public/post/2024/05/13/github-gitlab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-19 Thu 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GitHub or GitLab for Hobby Projects</title>
<meta name="author" content="Will S. Medrano" />
<meta name="generator" content="Org Mode" />

 <link rel="stylesheet"
          href="https://fonts.googleapis.com/css?family=Quicksand">
<link rel="stylesheet" href="/css/htmlize-styles.css">
<link rel="stylesheet" href="/css/styles.css">
</head>
<body>

<div class="navbar" id="org-div-home-and-up">
 <!--Ignore -->
 <a accesskey="H" href="/">wmedrano dot dev</a>
</div><div id="content" class="content">
<h1 class="title">GitHub or GitLab for Hobby Projects</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbd8d214">1. Introduction</a></li>
<li><a href="#org5999d57">2. Basics</a></li>
<li><a href="#org0565b38">3. Categories</a>
<ul>
<li><a href="#org7672867">3.1. Latency</a></li>
<li><a href="#orgfc25274">3.2. Community</a>
<ul>
<li><a href="#org25db3ba">3.2.1. Library Engagement Caveats</a></li>
<li><a href="#orge297adc">3.2.2. CI</a></li>
<li><a href="#orgd12d874">3.2.3. Security &amp; Reliability</a></li>
<li><a href="#orgdc48480">3.2.4. Features &amp; UX</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org978442f">4. Conclusion</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbd8d214" class="outline-2">
<h2 id="orgbd8d214"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
GitHub and GitLab are code hosting platforms. After using both, I prefer to keep
my solo developments needs on GitHub due to GitHub's larger community and faster
page loads.
</p>
</div>
</div>
<div id="outline-container-org5999d57" class="outline-2">
<h2 id="org5999d57"><span class="section-number-2">2.</span> Basics</h2>
<div class="outline-text-2" id="text-2">
<p>
Although GitLab also sells itself as a DevOps platform, both GitLab and GitHub
essentially have the same functionality. This is especially true for a
non-enterprise user like myself. My basic needs are:
</p>

<ul class="org-ul">
<li>Host code using Git. I’d prefer Mercurial, but I’ll take what I can get.
<ul class="org-ul">
<li>Allow browsing code. They both do the job here but pale in comparison to
something like SourceGraph.</li>
</ul></li>
<li>Automate workflows on Pull/Merge request for things such as building, running
tests, and deploying.</li>
<li>Facilitate feedback and contributions from others within the community.</li>
</ul>
</div>
</div>
<div id="outline-container-org0565b38" class="outline-2">
<h2 id="org0565b38"><span class="section-number-2">3.</span> Categories</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7672867" class="outline-3">
<h3 id="org7672867"><span class="section-number-3">3.1.</span> Latency</h3>
<div class="outline-text-3" id="text-3-1">
<p>
GitHub just feels snappier. I can’t help but get annoyed at how sluggish GitLab
presents its content. Doing a quick comparison of the code review page, I found
that GitLab takes <code>2.5s</code> to display code, while GitHub does so in <code>1.0s</code>.
</p>

<p>
Really, speed is the make or break feature for my usage. The latency GitLab
introduces is enough time for me to get distracted. This is especially
bothersome for the moments where I’m locked in and highly productive. Although
I’m very sensitive to latency, others may not mind. 
</p>
</div>
</div>
<div id="outline-container-orgfc25274" class="outline-3">
<h3 id="orgfc25274"><span class="section-number-3">3.2.</span> Community</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Surprisingly, some of the small libraries I use have had a small amount of
success in the open source community. Although I had no expectation that anyone
would find, let alone use my libraries, it’s satisfying when it does
happen. It’s even better when someone contributes back a feature or two.
</p>

<p>
GitHub’s community eclipses GitLab. Anecdotally, I’ve noticed most projects I
use tend to be on GitHub. In terms of contributions, GitHub projects seem to be
more lively as well. 
</p>
</div>
<div id="outline-container-org25db3ba" class="outline-4">
<h4 id="org25db3ba"><span class="section-number-4">3.2.1.</span> Library Engagement Caveats</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
All of my libraries are on GitHub while I only have a few prototype binaries on
GitLab. Libraries tend to attract at least a few users so it may be worth it for
me to experiment by developing some libraries on GitLab to get a better sense of
engagement. Unfortunately, my main job eats a lot of my time and energy leaving
very little for my side projects. Despite this, it does fell like the libraries
I find on GitHub tend to have more contributors than the ones on GitLab. 
</p>
</div>
</div>
<div id="outline-container-orge297adc" class="outline-4">
<h4 id="orge297adc"><span class="section-number-4">3.2.2.</span> CI</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
The CI between GitHub and GitLab is comparable. Both allow running builds,
lints, tests, and other checks before committing code.
</p>

<p>
GitHub’s implementation (GitHub Actions) involves writing YAML that can execute
commands and import other commands. These other commands have their own open
source ecosystem. The actions I’ve used do things like checkout repos, set up
Rust caching, upload code coverage results, and probably a few other actions.
</p>

<p>
GitLab’s ecosystem is more bare bones. You write YAML that executes commands,
similarly to GitHub, but unlike GitHub, there is no ecosystem of
actions/commands to import. Unpopular opinion, but I prefer not using magical
actions that are specific to GitHub’s platform to accomplish tasks. Despite the
lack of reusable actions, GitLab does have better artifacts support. Artifacts
are files that are produced by the CI. These can include anything like the
binary build, intermediate data, or, very nicely formatted HTML reports. In
GitLab, I enjoyed setting up several reports. My CI would build and test and
produce several neat artifacts like 
</p>

<ul class="org-ul">
<li>Code coverage report highlighting all lines that executed during the tests,
bringing attention to those that had no coverage.</li>
<li>Benchmark report, filled with insightful distribution plots.</li>
<li>Test suite report itemizing all unit tests with their result and runtime.</li>
</ul>

<p>
The CI would generate the reports and link to each report in the code review
UI. GitHub can similarly produce artifacts, but the artifacts are hard to
access. While GitLab HTML artifacts can be viewed directly in the browser,
GitHub requires downloading the artifacts as a zip file, after which the files
can be opened on the browser. GitHub has an <a href="https://github.com/actions/upload-artifact/issues/14">open issue</a> for this, maybe they’ll
get to it one day.
</p>
</div>
</div>
<div id="outline-container-orgd12d874" class="outline-4">
<h4 id="orgd12d874"><span class="section-number-4">3.2.3.</span> Security &amp; Reliability</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
I’m no expert in security or reliability. I don’t use GitHub or GitLab in my
professional work. But as an outsider, I can’t help but to watch some of
GitLab’s wrecks from the sidelines. Some infamous incidents include GitLab
deleting its own database (<a href="https://news.ycombinator.com/item?id=13537052">hackernews post 2017</a>) or the password exploit that
allow you to reset anyone’s password (<a href="https://news.ycombinator.com/item?id=39159002">hackernews post 2024</a>).
</p>
</div>
</div>
<div id="outline-container-orgdc48480" class="outline-4">
<h4 id="orgdc48480"><span class="section-number-4">3.2.4.</span> Features &amp; UX</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Overall, features &amp; UX for GitHub and GitLab are equivalent. There’s basically
no point to this section. I have a slight preference for GitLab in many ways,
but not enough to overcome any other deficiencies. Here’s a list of some of my
favorite features:
</p>

<ul class="org-ul">
<li>Easily browsing HTML artifacts. (OK, this one is actually a big deal IMO)</li>
<li>The GitLab sidebar looks nice. Maybe slightly clunky, but I prefer it over
GitHub.</li>
<li>Terminology. MergeRequest resonates with me more than PullRequest.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org978442f" class="outline-2">
<h2 id="org978442f"><span class="section-number-2">4.</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
Both GitHub and GitLab offer similar experiences for code and CI hosting. I
prefer GitHub due to its larger community and more responsive page loads. As the
underdog, I hope that GitLab, or any other great hosting platform, can make
strides to improve for solo and small open source development.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<div></div>
<p class="postamble-title">Title: GitHub or GitLab for Hobby Projects</p>
<p class="author">Author: Will S. Medrano</p>
<p class="date">Date: 2024-05-13</p>
</div>
</body>
</html>
